#+TITLE: Perturbation plots

* Setup

#+BEGIN_SRC jupyter-python
import numpy as np
import statsmodels.api as sm
from statsmodels.sandbox.regression.predstd import wls_prediction_std
import matplotlib.pyplot as plt
import os
from tqdm import tqdm, trange
import pandas as pd
from scipy import signal
from scipy.stats import gaussian_kde
from glob import glob
import pickle
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python
import sys
project_path = "/home/lili/research/tuthill/layered-walking"
data_path = '/home/lili/data/tuthill/models/sls_runs'
sys.path.append(project_path)
from tools.angle_functions import anglesTG as angle_names_1leg
from tools.angle_functions import legs
from tools.angle_functions import make_fly_video, angles_to_pose_names
from tools.trajgen_tools import WalkingData
from tools.dist_tools import DistType
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.decomposition import PCA
%matplotlib inline

plt.style.use('default')
plt.rcParams['figure.figsize'] = (7.5, 2)
#+END_SRC


#+RESULTS:

#+BEGIN_SRC jupyter-python
xvals = np.linspace(-np.pi, np.pi)
def get_phase(ang):
    m = np.median(ang, axis=0)
    s = np.std(ang, axis=0)
    s[s == 0] = 1
    dm = (ang - m) / s
    phase = np.arctan2(-dm[:,1], dm[:,0])
    return phase

def phase_align_poly(ang, extra=None, order=5):
    topredict = ang
    if extra is not None:
        topredict = np.hstack([ang, extra])
    means = np.full((len(xvals), topredict.shape[1]), np.nan)
    stds = np.full((len(xvals), topredict.shape[1]), np.nan)
    if len(ang) < 50: # not enough data
        return means, stds
    phase = get_phase(ang)
    # pcs = np.vstack([np.cos(phase), np.sin(phase)]).T
    b = np.vstack([np.cos(i * phase + j) for i in range(order) for j in [0, np.pi/2]]).T
    xcs = np.vstack([np.cos(i * xvals + j) for i in range(order) for j in [0, np.pi/2]]).T
    for i in range(topredict.shape[1]):
        cc = np.isfinite(topredict[:,i])
        model = sm.OLS(topredict[cc,i], b[cc]).fit()
        means[:,i] = model.predict(xcs)
        s, upper,lower = wls_prediction_std(model, xcs)
        stds[:,i] = s
    return means, stds

#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python
# list(d.keys())
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python
fname_pat = os.path.join(data_path, 'delays_stats_subang_v6_sense_actuation*.pkl')
fnames = sorted(glob(fname_pat))

fname_pat = os.path.join(data_path, 'delays_stats_subang_v7_sense_actuation*.pkl')
fnames += sorted(glob(fname_pat))

conditions = []
angles = []
derivs = []
accels = []

for fname in tqdm(fnames, ncols=70):
    # d = np.load(fname, allow_pickle=True)
    with open(fname, 'rb') as f:
        d = pickle.load(f)

    try:
        angle_names = d['angleNames'][0]
    except:
        print(fname)
        continue

    for i, cond in enumerate(d['conditions']):
        ang = d['angle'][i]
        deriv = signal.savgol_filter(ang, 5, 2, deriv=1, axis=0)
        accel = signal.savgol_filter(deriv, 5, 2, deriv=1, axis=0)
        if 'senseDelay' not in cond:
            cond['senseDelay'] = 0.010 # fixed
        if 'actDelay' not in cond:
            cond['actDelay'] = 0.030
        conditions.append(cond)
        angles.append(ang)
        derivs.append(deriv)
        accels.append(accel)
#+END_SRC

#+RESULTS:
:RESULTS:
:   2%|▊                               | 21/866 [00:18<14:37,  1.04s/it]/home/lili/data/tuthill/models/sls_runs/delays_stats_subang_v6_sense_actuation_gaussian_001050.pkl
:
:  52%|████████████████▎              | 454/866 [34:51<07:10,  1.04s/it]/home/lili/data/tuthill/models/sls_runs/delays_stats_subang_v6_sense_actuation_poisson_001050.pkl
:
: 100%|█████████████████████████████| 866/866 [1:12:05<00:00,  4.99s/it]
:
:END:


#+BEGIN_SRC jupyter-python
conditions[0]
#+END_SRC

#+RESULTS:
| context | : | (12 0 0) | offset | : | 0 | dist | : | <DistType.IMPULSE: | 7> | maxVelocity | : | 0.0 | senseDelay | : | 0.0 | actDelay | : | 0.0 |



#+BEGIN_SRC jupyter-python
perturb_ranges = {
    'before': (0, 300),
    'during': (300, 600),
    'after': (600, 900)
}
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python
speeds = np.array([x['context'] for x in conditions])
dist_types = np.array([x['dist'].value for x in conditions])
act_delays = np.array([x['actDelay'] for x in conditions])
sense_delays = np.array([x['senseDelay'] for x in conditions])
max_velocities = np.array([x['maxVelocity'] for x in conditions])
angle_names = list(angle_names)
#+END_SRC

#+RESULTS:


#+BEGIN_SRC jupyter-python
fname = '/home/lili/data/tuthill/models/models_sls/walk_sls_legs_subang_6.pickle'
wd = WalkingData(fname)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python
wd.bout_context
#+END_SRC

#+RESULTS:
: array([[ 3.4748168, 18.434208 ,  2.642376 ],
:        [ 1.0033004, 20.97231  ,  3.094752 ],
:        [ 1.4011644, 11.787567 ,  2.894012 ],
:        ...,
:        [ 9.824624 ,  3.8363965,  2.475409 ],
:        [13.015    , -0.6182214,  1.8810371],
:        [ 6.7187276, -3.0979152,  2.84063  ]], dtype=float32)

#+BEGIN_SRC jupyter-python
fancy_angle_names = {
    'C_flex': 'femur-tibia\nflexion',
    'A_rot': 'coxa\nrotation',
    'A_abduct': 'body-coxa\nflexion',
    'B_flex': 'coxa-femur\nflexion',
    'B_rot': 'femur\nrotation'
}
#+END_SRC

#+RESULTS:

